app/controllers/article_controller.rb

    def create
        u = User.find(params[:user_id])
        a = u.articles.create(
            title: params[:title],
            content: params[:content],
            date: params[:date],
            likesNo: params[:likesNo],
            commentNo: params[:commentNo],
            article_imageURL: params[:article_imageURL]
        )

        categoryArray = params[:categories]
        categoryArray.each{
            |categoryEle|
            ArticleCategory.create(article_id: a.id, category_id: categoryEle)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("user_id", "title", "content", "date", "likesNo", "commentNo", "article_imageURL", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "article_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 3], ["category_id", 1], ["created_at", "2023-02-07 18:38:41.751134"], ["updated_at", "2023-02-07 18:38:41.751134"]]

    def readAll
        articles = Article.all
---
SELECT "articles".* FROM "articles"

    def readByTitle
        a = Article.where("title LIKE ?", "%#{params[:title]}%")
---
SELECT "articles".* FROM "articles" WHERE (title LIKE '%ee%')

    def readPage
        pages = (params[:pageNo]).to_i
        pages = pages - 1;
        lim = 2
        a = 0
        for i in 1..pages
            a += lim
        end
        a = Article.offset(a).limit(lim)
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 6]]

    def readByRange
        a = Article.where(date: (params[:start]..params[:end]))
---
SELECT "articles".* FROM "articles" WHERE "articles"."date" BETWEEN ? AND ?  [["date", "2009-01-01"], ["date", "2011-12-31"]]

    def readUserArticles
        a = Article.where(user_id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]

    def update
        a = Article.find(params[:id])
        a.title = params[:title] || a.title
        a.content = params[:content] || a.content
        a.date = params[:date] || a.date
        a.article_imageURL = params[:article_imageURL] || a.article_imageURL
        a.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "date" = ?, "updated_at" = ? WHERE "articles"."id" = ?

    def delete
        a = Article.find(params[:id])
        ArticleCategory.where(article_id: a.id).each{
            |a|
            a.delete
        }
        a.delete
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "article_categories".* FROM "article_categories" WHERE "article_categories"."article_id" = ?  [["article_id", 9]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
DELETE FROM "article_categories" WHERE "article_categories"."id" = ?  [["id", 13]]
DELETE FROM "article_categories"
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 9]]

    def deleteAll
        ArticleCategory.delete_all
---
DELETE FROM "article_categories"
DELETE FROM "articles"